tutorials/multicomponentFluid/filter/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 350;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform 400;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 350;
    }
    outlet
    {
        type            zeroGradient;
    }
    cycLeft_half0
    {
        type            cyclic;
    }
    cycRight_half0
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
    cycLeft_half1
    {
        type            cyclic;
    }
    cycRight_half1
    {
        type            cyclic;
    }
}

sources
{
    massSource
    {
        type            uniformInletOutlet;
        uniformInletValue 450;
    }
}


// ************************************************************************* //
